/* original app has been modified and moved */
"%1$@ has been updated and moved. Do you want to change all your keychain items to allow the new version access to your keychain?" = "Программа «%1$@» была обновлена и перемещена. Изменить все объекты связки ключей, чтобы новая версия имела к ним доступ?";

/* original app has been updated (paths equal) v2 */
"%1$@ has been updated. Do you want to allow the new version to access the same keychain items (such as passwords) as the previous version?" = "Обновление «%1$@» выполнено. Хотите, чтобы новая версия имела доступ к тем же объектам связки ключей (таким как пароли), что и предыдущая версия?";

/* original app has been updated (paths equal) */
"%1$@ has been updated. Do you want to change all your keychain items to allow the new version access to your keychain?" = "Программа «%1$@» была обновлена. Изменить все объекты связки ключей, чтобы новая версия имела к ним доступ?";

/* Descriptive text for when the app doesn't match the item's ACL. */
"%1$@ may have been updated or changed, perhaps during a software update. Because of this you need to allow permission to use the keychain item." = "Программа «%1$@» была обновлена или изменена, возможно, при обновлении программного обеспечения. Поэтому нужно разрешить доступ к объекту связки ключей.";

/* Descriptive text for when the app doesn't match the item acls in a keychain's items. */
"%1$@ may have been updated or changed, perhaps during a software update. Because of this you need to allow permission to use the keychain." = "Программа «%1$@» была обновлена или изменена, возможно, при обновлении программного обеспечения. Поэтому нужно разрешить доступ к Связке ключей.";

/* Confirm Access message text when operation is unknown. %1$@ is replaced by the name of the application making the request, %2$@ is replaced by the label of the key affected. */
"%1$@ wants to access key \\U201C%2$@\\U201D in your keychain." = "«%1$@» хочет получить доступ к ключу «%2$@» в Вашей связке ключей.";

/* Confirm Access message text when attempting to generate a key. %1$@ is replaced by the name of the application making the request, %2$@ is replaced by the label of the key being generated. */
"%1$@ wants to add the  \\U201C%2$@\\U201D item to your keychain." = "«%1$@» хочет добавить объект «%2$@» в Вашу связку ключей.";

/* Confirm Access message text when attempting to modify the ACL of a key. %1$@ is replaced by the name of the application making the request, %2$@ is replaced by the label of the key of which the ACL is being changed. */
"%1$@ wants to change access permissions of the \\U201C%2$@\\U201D item in your keychain." = "«%1$@» хочет изменить права доступа к объекту «%2$@» в Вашей связке ключей.";

/* Confirm Access message text when attempting to modify the owner of a key. %1$@ is replaced by the name of the application making the request, %2$@ is replaced by the label of the key of which the owner is being changed. */
"%1$@ wants to change the owner of the \\U201C%2$@\\U201D item in your keychain (the owner of the item is the one allowed to change access permissions)." = "«%1$@» хочет изменить владельца объекта «%2$@» в связке ключей (владелец объекта имеет право изменять права доступа).";

/* Confirm Access message text when attempting to decrypt using a key. %1$@ is replaced by the name of the application making the request, %2$@ is replaced by the label of the key being used. */
"%1$@ wants to decrypt the \\U201C%2$@\\U201D item in your keychain." = "«%1$@» хочет расшифровать объект «%2$@» в Вашей связке ключей.";

/* Confirm Access message text when attempting to delete a key. %1$@ is replaced by the name of the application making the request, %2$@ is replaced by the label of the key being being deleted. */
"%1$@ wants to delete the \\U201C%2$@\\U201D item from your keychain." = "«%1$@» хочет удалить объект «%2$@» из Вашей связки ключей.";

/* Confirm Access message text when attempting to derive a key from a key. %1$@ is replaced by the name of the application making the request, %2$@ is replaced by the label of the key being used to derive a key from. */
"%1$@ wants to derive a key from key \\U201C%2$@\\U201D in your keychain." = "«%1$@» хочет извлечь ключ из ключа «%2$@» в Вашей связке ключей.";

/* Confirm Access message text when attempting to encrypt using a key. %1$@ is replaced by the name of the application making the request, %2$@ is replaced by the label of the key being used. */
"%1$@ wants to encrypt using key \\U201C%2$@\\U201D in your keychain." = "«%1$@» хочет шифровать с использованием ключа «%2$@» Вашей связки ключей.";

/* Confirm Access message text when attempting to export a key in wrapped form. %1$@ is replaced by the name of the application making the request, %2$@ is replaced by the label of the key being exported. */
"%1$@ wants to export key \\U201C%2$@\\U201D from your keychain." = "«%1$@» хочет экспортировать ключ «%2$@» из Вашей связки ключей.";

/* Confirm Access message text when attempting to import a key. %1$@ is replaced by the name of the application making the request, %2$@ is replaced by the label of the key being imported. */
"%1$@ wants to import key \\U201C%2$@\\U201D into your keychain." = "«%1$@» хочет импортировать ключ «%2$@» в Вашу связку ключей.";

/* Confirm Access message text when attempting to sign using a key. %1$@ is replaced by the name of the application making the request, %2$@ is replaced by the label of the key being used. */
"%1$@ wants to sign using key \\U201C%2$@\\U201D in your keychain." = "«%1$@» хочет подписать с использованием ключа «%2$@» в Вашей связке ключей.";

/* Confirm Access message text when attempting to sign using a key. %1$@ is replaced by the name of the application making the request, %2$@ is replaced by the label of the key being used. */
"%1$@ wants to sign with key \\U201C%2$@\\U201D in your keychain." = "«%1$@» хочет подписать ключом «%2$@» Вашей связки ключей.";

/* Unlock reason */
"%1$@ wants to use the \\U201C%2$@\\U201D keychain." = "«%1$@» хочет использовать связку ключей «%2$@».";

/* Confirm Access message text when attempting to decrypt using a groupkey. %1$@ is replaced by the name of the application making the request. %2$@ says '...allow?' or '...enter keychain password' if password is required for the operation. */
"%1$@ wants to use your .Mac password. %2$@" = "«%1$@» хочет использовать пароль Вашей учетной записи .Mac. %2$@";

/* Confirm Access message text when attempting to decrypt using a groupkey. %1$@ is replaced by the name of the application making the request, %2$@ is replaced by the label of the key being used. */
"%1$@ wants to use your confidential information stored in \\U201C%2$@\\U201D in your keychain." = "«%1$@» хочет использовать конфиденциальную информацию, хранящуюся в «%2$@» в Вашей связке ключей.";

/* Part of the Confirm Access message text when application fails static code-signing verification.  %1$@ is replaced by the name of the application making the request. */
"\\U201C%1$@\\U201D has been altered on disk. You might be running something that is pretending to be \\U201C%1$@\\U201D." = "На диске был изменен объект «%1$@». Вероятно, Вы запустили программу, имитирующую «%1$@».";

/* Part of the Confirm Access message text when application has failed dynamic code-signing verification.  %1$@ is replaced by the name of the application making the request. */
"\\U201C%1$@\\U201D has been modified while running and no longer conforms to what was installed on disk." = "Объект «%1$@» был изменен во время открытия и больше не соответствует установленному на диске.";

/* Part of the Confirm Access message text when neither a signature nor a path is available to verify the application. */
"\\U201C%1$@\\U201D is unknown. Access is denied." = "«%1$@» неизвестно. Доступ отклонен.";

/* new app introduced, give it access? */
"An application named %1$@ needs to access your keychain, but there is an existing version. Do you want to change all your keychain items to allow the new version access to your keychain?" = "Программе «%1$@» нужен доступ к Связке ключей, но эта программа была изменена с момента последнего доступа. Изменить все объекты связки ключей, чтобы разрешить новой версии доступ к Связке ключей?";

/* AppType */
"Application:" = "Программа:";

/* Authentication no longer needed */
"Authentication is no longer needed." = "Идентификация больше не понадобится.";

/* Cancel button title */
"Cancel" = "Отменить";

/* changed application wanting access */
"Changed Process:" = "Измененная программа:";

/* confirm that a application changed panel title string */
"Confirm Application Change" = "Подтвердить изменение программы";

/* Copy Location To Clipboard SFURLView menu item */
"Copy Location To Clipboard" = "Копировать размещение в буфер обмена";

/* Detail disclosure button label.  Details about authorization requests. */
"Detail" = "Подробнее";

/* Do you want to allow access to this item? */
"Do you want to allow access to this item?" = "Вы хотите предоставить доступ к этому объекту?";

/* Do you want to allow this? */
"Do you want to allow this?" = "Разрешить?";

/* Password for a newly created keychain, change keychain password. */
"Enter a new password for the keychain \\U201C%1$@.\\U201D" = "Введите новый пароль для связки ключей «%1$@».";

/* When configuring a keychain on additional Macs (non-login kc) */
"Enter the password for keychain \\U201C%1$@\\U201D on \\U201C%2$@\\U201D." = "Введите пароль для связки ключей «%1$@» на «%2$@».";

/* Enter the password for keychain \\U201C%1$@\\U201D on one of the computers you have synchronized. */
"Enter the password for keychain \\U201C%1$@\\U201D on one of the computers you have synchronized." = "Введите пароль для связки ключей «%1$@» на одном из синхронизированных Вами компьютере.";

/* Part of the Confirm Access message text when application signature cannot be verified.  %1$@ is replaced by the name of the application making the request. */
"It is not possible to tell whether \\U201C%1$@\\U201D is unchanged from the last time it was used. Someone could have modified or replaced it." = "Невозможно установить, был ли изменен «%1$@» после последнего использования. Вероятно, он был изменен или заменен.";

/* Keychain Access application's name */
"Keychain Access.app" = "Связка ключей.app";

/* When referring to a faceless application or tool that represents the system, Mac OS X, your computer, your system, this replaces the client name in the authentication dialog */
"Mac OS X" = "Mac OS X";

/* Shown instead of Password: when asking the user to provide a new password or change an old one. */
"New Password:" = "Новый пароль:";

/* No button title */
"No" = "Нет";

/* Sometimes no password is required and the field is inactive.  This string is set in it as a placeholder. */
"Not required." = "Не требуется.";

/* OK button title */
"OK" = "ОК";

/* Show user provided hint to help remember password */
"Password hint: \\U201C%1$@\\U201D." = "Подсказка: «%1$@».";

/* In the case of a smartcard instead of a keychain, the PIN label is substituted where the Password label is. */
"PIN:" = "PIN:";

/* Unlock reason detail */
"Please enter the keychain password." = "Введите пароль связки ключей.";

/* Typical pwd suggestion */
"Secure passwords typically are longer than 6 characters and should not contain obvious words like dog, cat, and so on." = "Безопасные пароли обычно имеют длину более 6 символов и не должны содержать очевидные слова, например, dog, cat и т.д.";

/* Authentication unable to continue */
"Sorry, unable to continue the authentication." = "К сожалению, идентификацию продолжить невозможно.";

/* Unlock unable to continue */
"Sorry, unable to continue the unlock." = "К сожалению, снятие защиты невозможно.";

/* Authentication canceled */
"Sorry, you attempted to authenticate too many times." = "К сожалению, Вы превысили допустимое количество попыток идентификации.";

/* NewPwd canceled */
"Sorry, you attempted to set your password for the \\U201C%1$@\\U201D keychain too many times." = "К сожалению, Вы превысили максимальное количество попыток ввода пароля для связки ключей «%1$@».";

/* Unlock canceled */
"Sorry, you attempted to unlock \\U201C%1$@\\U201D too many times." = "Извините, но Вы превысили максимальное количество попыток открытия «%1$@».";

/* Unlock failed; invalid password */
"Sorry, you entered an invalid password." = "Введенный пароль неверен.";

/* For referring to the system keychain. */
"System" = "Системная";

/* Application with same name is different and possibly in a different location as well. */
"The \\U201C%1$@\\U201D software on your computer has changed and wants to access your keychain." = "ПО «%1$@» на Вашем компьютере изменилось и требует доступа к связке ключей.";

/* Part of the Confirm Access informational text when application is unsigned.  %1$@ is replaced by the name of the application making the request. */
"The authenticity of \\U201C%1$@\\U201D cannot be verified." = "Не удается проверить подлинность «%1$@».";

/* error after succefully entering a password which then fails to get added to a keychain. */
"The item could not be added to your default keychain." = "Элемент не может быть добавлен в Вашу стандартную связку ключей.";

/* detailed message for allowing a process to have the same access as original app v2. */
"The keychain items may include passwords and other important information. If you click Allow, the new version of \\U201C%1$@\\U201D will have access to all the keychain items used by previous version. This change is permanent." = "Объекты связки ключей могут включать в себя пароли и другую важную информацию. При нажатии «Разрешить» новая версия «%1$@» получит доступ ко всем объектам связки ключей, используемым предыдущей версией. Это изменение окончательное.";

/* Authentication failed; invalid username or password */
"The name or password you entered is incorrect." = "Вы ввели неверные имя или пароль.";

/* detailed message for allowing a process to have the same access as original app. */
"This change is permanent and affects all keychain items in all your keychains." = "Это изменение постоянное и касается всех объектов во всех связках ключей.";

/* Application with same name is different and possibly in a different location as well. */
"This is a new version of the application \\U201C%1$@\\U201D. Do you want to allow it to access the same keychain items as the previous version?" = "Это новая версия программы «%1$@». Хотите, чтобы она имела доступ к тем же объектам связки ключей, что и предыдущая версия?";

/* When configuring a keychain on additional Macs - details text */
"This is the same password you used to first synchronize your keychain \\U201C%@\\U201D with .Mac." = "Это тот же самый пароль, который Вы использовали для первой синхронизации связки ключей «%@» с учетной записью .Mac.";

/* Please enter the keychain password. */
"To allow this, enter the \\U201C%1$@\\U201D keychain password." = "Чтобы разрешить это, введите пароль для связки ключей «%1$@».";

/* When configuring a keychain on additional Macs (login kc) */
"To synchronize your keychain on this computer, enter the password for your user account on \\U201C%1$@\\U201D." = "Введите пароль для Вашей учетной записи на «%1$@», чтобы синхронизировать связку ключей на этом компьютере.";

/* To synchronize your keychain on this computer, enter your user account password for any of the computers you synchronize. */
"To synchronize your keychain on this computer, enter your user account password for any of the computers you synchronize." = "Введите пароль учетной записи пользователя для всех синхронизируемых Вами компьютеров, чтобы синхронизировать связку ключей на этом компьютере.";

/* ToolType */
"Tool:" = "Инструмент:";

/* Try again later */
"Try again later." = "Повторите попытку позже.";

/* Please Try again */
"Try entering your information again." = "Попытайтесь повторно ввести информацию.";

/* Authenticate greeting changing the system certificate Trust Settings. */
"Type an administrator's name and password to make changes to the System Certificate Trust Settings." = "Требуется имя и пароль администратора для внесения изменений в настройки доверия сертификата системы.";

/* Authenticate greeting for a non-admin asking to authenticate as an admin.  %1$@ gets replaced with Application name, or the localized string representing the system (Mac OS X). */
"Type an administrator\\U2019s name and password to allow %1$@ to make changes." = "Чтобы внести изменения в объект «%1$@», введите имя и пароль администратора.";

/* Authenticate greeting for any group.  %1$@ gets replaced with group name and %2$@ gets replaced with the calling Application's name, or the localized string representing the system (Mac OS X). */
"Type the name and password of a user in the \\U201C%1$@\\U201D group to allow %2$@ to make changes." = "Чтобы внести изменения в объект «%2$@», введите имя и пароль пользователя в группе «%1$@».";

/* Authenticate greeting for an admin, or a user that can authorize.  %1$@ gets replaced with Application name, or the localized string representing the system (Mac OS X). */
"Type your password to allow %1$@ to make changes." = "Введите пароль, чтобы разрешить программе «%1$@» вносить изменения.";

/* Authenticate greeting changing the per-user certificate Trust Settings. */
"Type your password to make changes to your Certificate Trust Settings." = "Введите Ваш пароль, чтобы внести изменения в Ваши настройки доверия сертификата.";

/* UnkownProcessType */
"Unknown:" = "Неизвестно:";

/* Unlock no longer needed */
"Unlock is no longer needed." = "Открытие больше не потребуется.";

/* Yes button title */
"Yes" = "Да";

/* pwd is blank */
"You have not provided a password. Please specify one." = "Вы не предоставили пароль. Укажите его.";

/* pwd too simple */
"You have specified a non-secure password. Please use a longer one." = "Вы указали небезопасный пароль. Введите более длинный пароль.";

/* used that pwd before */
"You have used that password before. Please use a different one." = "Вы уже использовали этот пароль ранее. Выберите другой пароль.";

/* Authentication failure for admin group.  %1$@ gets replaced with Application name. */
"You must type an administrator\\U2019s name and password to make changes to %1$@." = "Чтобы внести изменения в объект «%1$@», необходимо ввести имя и пароль администратора.";

/* Authentication failure for any group.  %1$@ gets replaced with group name and %2$@ gets replaced with the calling Application's name. */
"You must type the name and password of a user in the \\U201C%1$@\\U201D group to make changes to %2$@." = "Чтобы внести изменения в объект «%2$@», необходимо ввести имя и пароль пользователя в группе «%1$@».";

/* NewPwd verify not equal */
"Your password is not the same as the verify password." = "Пароль и его подтверждение не совпадают.";

/* pwd unacceptable */
"Your password is unacceptable." = "Пароль не принимается.";

